RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/inc/ht32f5xxxx_can.h
#define CAN_IF_CMASK_MASK_Pos      6                                     /*!< CAN_T::IFnCMASK: MASK Position          */
#define CAN_IF_CMASK_MASK      (1ul << CAN_IF_CMASK_MASK_Pos)            /*!< CAN_T::IFnCMASK: MASK                   */

#define CAN_IF_CMASK_ARB_Pos       5                                     /*!< CAN_T::IFnCMASK: ARB Position           */
#define CAN_IF_CMASK_ARB       (1ul << CAN_IF_CMASK_ARB_Pos)             /*!< CAN_T::IFnCMASK: ARB                    */

#define CAN_IF_CMASK_CONTROL_Pos   4                                     /*!< CAN_T::IFnCMASK: CONTROL Position       */
#define CAN_IF_CMASK_CONTROL   (1ul << CAN_IF_CMASK_CONTROL_Pos)         /*!< CAN_T::IFnCMASK: CONTROL                */

#define CAN_IF_CMASK_CLRINTPND_Pos 3                                     /*!< CAN_T::IFnCMASK: CLRINTPND Position     */
#define CAN_IF_CMASK_CLRINTPND (1ul << CAN_IF_CMASK_CLRINTPND_Pos)       /*!< CAN_T::IFnCMASK: CLRINTPND              */

#define CAN_IF_CMASK_TXRQSTNEWDAT_Pos 2                                  /*!< CAN_T::IFnCMASK: TXRQSTNEWDAT Position  */
#define CAN_IF_CMASK_TXRQSTNEWDAT (1ul << CAN_IF_CMASK_TXRQSTNEWDAT_Pos) /*!< CAN_T::IFnCMASK: TXRQSTNEWDAT           */

#define CAN_IF_CMASK_DATAA_Pos     1                                     /*!< CAN_T::IFnCMASK: DATAA Position         */
#define CAN_IF_CMASK_DATAA     (1ul << CAN_IF_CMASK_DATAA_Pos)           /*!< CAN_T::IFnCMASK: DATAA                  */

#define CAN_IF_CMASK_DATAB_Pos     0                                     /*!< CAN_T::IFnCMASK: DATAB Position         */
#define CAN_IF_CMASK_DATAB     (1ul << CAN_IF_CMASK_DATAB_Pos)           /*!< CAN_T::IFnCMASK: DATAB                  */

/**
 * @brief CAN IFn_MASK0 Bit Field Definitions
 */
#define CAN_IF_MASK0_MSK_Pos       0                                    /*!< CAN_T::IFnMASK0: MSK Position  */
#define CAN_IF_MASK0_MSK_Msk       (0xFFul << CAN_IF_MASK0_MSK_Pos)     /*!< CAN_T::IFnMASK0: MSK Mask      */

/**
 * @brief CAN IFn_MASK1 Bit Field Definitions
 */
#define CAN_IF_MASK1_MXTD_Pos      15                                   /*!< CAN_T::IFnMASK1: MXTD Position */
#define CAN_IF_MASK1_MXTD          (1ul << CAN_IF_MASK1_MXTD_Pos)       /*!< CAN_T::IFnMASK1: MXTD          */

#define CAN_IF_MASK1_MDIR_Pos      14                                   /*!< CAN_T::IFnMASK1: MDIR Position */
#define CAN_IF_MASK1_MDIR          (1ul << CAN_IF_MASK1_MDIR_Pos)       /*!< CAN_T::IFnMASK1: MDIR          */

#define CAN_IF_MASK1_MSK_Pos       0                                    /*!< CAN_T::IFnMASK1: MSK Position  */
#define CAN_IF_MASK1_MSK_Msk       (0x1FFul << CAN_IF_MASK1_MSK_Pos)    /*!< CAN_T::IFnMASK1: MSK Mask      */

/**
 * @brief CAN IFn_ARB0 Bit Field Definitions
 */
#define CAN_IF_ARB0_ID_Pos         0                                    /*!< CAN_T::IFnARB0: ID Position    */
#define CAN_IF_ARB0_ID_Msk         (0xFFFFul << CAN_IF_ARB0_ID_Pos)     /*!< CAN_T::IFnARB0: ID Mask        */

/**
 * @brief CAN IFn_ARB1 Bit Field Definitions
 */
#define CAN_IF_ARB1_MSGVAL_Pos     15                                  /*!< CAN_T::IFnARB1: MSGVAL Position */
#define CAN_IF_ARB1_MSGVAL         (1ul << CAN_IF_ARB1_MSGVAL_Pos)     /*!< CAN_T::IFnARB1: MSGVAL          */

#define CAN_IF_ARB1_XTD_Pos        14                                  /*!< CAN_T::IFnARB1: XTD Position    */
#define CAN_IF_ARB1_XTD            (1ul << CAN_IF_ARB1_XTD_Pos)        /*!< CAN_T::IFnARB1: XTD             */

#define CAN_IF_ARB1_DIR_Pos        13                                  /*!< CAN_T::IFnARB1: DIR Position    */
#define CAN_IF_ARB1_DIR            (1ul << CAN_IF_ARB1_DIR_Pos)        /*!< CAN_T::IFnARB1: DIR             */

#define CAN_IF_ARB1_ID_Pos         0                                   /*!< CAN_T::IFnARB1: ID Position     */
#define CAN_IF_ARB1_ID_Msk         (0x1FFFul << CAN_IF_ARB1_ID_Pos)    /*!< CAN_T::IFnARB1: ID Mask         */

/**
 * @brief CAN IFn_MCR Bit Field Definitions
 */
#define CAN_IF_MCR_NEWDAT_Pos     15                                   /*!< CAN_T::IFnMCON: NEWDAT Position */
#define CAN_IF_MCR_NEWDAT         (1ul << CAN_IF_MCR_NEWDAT_Pos)       /*!< CAN_T::IFnMCON: NEWDAT          */

#define CAN_IF_MCR_MSGLST_Pos     14                                   /*!< CAN_T::IFnMCON: MSGLST Position */
#define CAN_IF_MCR_MSGLST         (1ul << CAN_IF_MCR_MSGLST_Pos)       /*!< CAN_T::IFnMCON: MSGLST          */

#define CAN_IF_MCR_INTPND_Pos     13                                   /*!< CAN_T::IFnMCON: INTPND Position */
#define CAN_IF_MCR_INTPND         (1ul << CAN_IF_MCR_INTPND_Pos)       /*!< CAN_T::IFnMCON: INTPND          */

#define CAN_IF_MCR_UMASK_Pos      12                                   /*!< CAN_T::IFnMCON: UMASK Position  */
#define CAN_IF_MCR_UMASK          (1ul << CAN_IF_MCR_UMASK_Pos)        /*!< CAN_T::IFnMCON: UMASK           */

#define CAN_IF_MCR_TXIE_Pos       11                                   /*!< CAN_T::IFnMCON: TXIE Position   */
#define CAN_IF_MCR_TXIE           (1ul << CAN_IF_MCR_TXIE_Pos)         /*!< CAN_T::IFnMCON: TXIE            */

#define CAN_IF_MCR_RXIE_Pos       10                                   /*!< CAN_T::IFnMCON: RXIE Position   */
#define CAN_IF_MCR_RXIE           (1ul << CAN_IF_MCR_RXIE_Pos)         /*!< CAN_T::IFnMCON: RXIE            */

#define CAN_IF_MCR_RMTEN_Pos      9                                    /*!< CAN_T::IFnMCON: RMTEN Position  */
#define CAN_IF_MCR_RMTEN          (1ul << CAN_IF_MCR_RMTEN_Pos)        /*!< CAN_T::IFnMCON: RMTEN           */

#define CAN_IF_MCR_TXRQST_Pos     8                                    /*!< CAN_T::IFnMCON: TXRQST Position */
#define CAN_IF_MCR_TXRQST         (1ul << CAN_IF_MCR_TXRQST_Pos)       /*!< CAN_T::IFnMCON: TXRQST          */

#define CAN_IF_MCR_EOB_Pos        7                                    /*!< CAN_T::IFnMCON: EOB Position    */
#define CAN_IF_MCR_EOB            (1ul << CAN_IF_MCR_EOB_Pos)          /*!< CAN_T::IFnMCON: EOB             */

#define CAN_IF_MCR_DLC_Pos        0                                    /*!< CAN_T::IFnMCON: DLC Position    */
#define CAN_IF_MCR_DLC_Msk        (0xFul << CAN_IF_MCR_DLC_Pos)       /*!< CAN_T::IFnMCON: DLC Mask         */

/**
 * @brief CAN IFn_DATA_A0 Bit Field Definitions
 */
#define CAN_IF_DAT_A0_DATA1_Pos   8                                   /*!< CAN_T::IFnDATAA0: DATA1 Position */
#define CAN_IF_DAT_A0_DATA1_Msk   (0xFFul << CAN_IF_DAT_A0_DATA1_Pos) /*!< CAN_T::IFnDATAA0: DATA1 Mask     */

