RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/inc/ht32f5xxxx_can.h
#define CAN_IF_DAT_A0_DATA0_Pos   0                                   /*!< CAN_T::IFnDATAA0: DATA0 Position */
#define CAN_IF_DAT_A0_DATA0_Msk   (0xFFul << CAN_IF_DAT_A0_DATA0_Pos) /*!< CAN_T::IFnDATAA0: DATA0 Mask     */

/**
 * @brief CAN IFn_DATA_A1 Bit Field Definitions
 */
#define CAN_IF_DAT_A1_DATA3_Pos   8                                   /*!< CAN_T::IFnDATAA1: DATA3 Position */
#define CAN_IF_DAT_A1_DATA3_Msk   (0xFFul << CAN_IF_DAT_A1_DATA3_Pos) /*!< CAN_T::IFnDATAA1: DATA3 Mask     */

#define CAN_IF_DAT_A1_DATA2_Pos   0                                   /*!< CAN_T::IFnDATAA1: DATA2 Position */
#define CAN_IF_DAT_A1_DATA2_Msk   (0xFFul << CAN_IF_DAT_A1_DATA2_Pos) /*!< CAN_T::IFnDATAA1: DATA2 Mask     */

/**
 * @brief CAN IFn_DATA_B0 Bit Field Definitions
 */
#define CAN_IF_DAT_B0_DATA5_Pos   8                                   /*!< CAN_T::IFnDATAB0: DATA5 Position */
#define CAN_IF_DAT_B0_DATA5_Msk   (0xFFul << CAN_IF_DAT_B0_DATA5_Pos) /*!< CAN_T::IFnDATAB0: DATA5 Mask     */

#define CAN_IF_DAT_B0_DATA4_Pos   0                                   /*!< CAN_T::IFnDATAB0: DATA4 Position */
#define CAN_IF_DAT_B0_DATA4_Msk   (0xFFul << CAN_IF_DAT_B0_DATA4_Pos) /*!< CAN_T::IFnDATAB0: DATA4 Mask     */

/**
 * @brief CAN IFn_DATA_B1 Bit Field Definitions
 */
#define CAN_IF_DAT_B1_DATA7_Pos   8                                   /*!< CAN_T::IFnDATAB1: DATA7 Position */
#define CAN_IF_DAT_B1_DATA7_Msk   (0xFFul << CAN_IF_DAT_B1_DATA7_Pos) /*!< CAN_T::IFnDATAB1: DATA7 Mask     */

#define CAN_IF_DAT_B1_DATA6_Pos   0                                   /*!< CAN_T::IFnDATAB1: DATA6 Position */
#define CAN_IF_DAT_B1_DATA6_Msk   (0xFFul << CAN_IF_DAT_B1_DATA6_Pos) /*!< CAN_T::IFnDATAB1: DATA6 Mask     */

/**
 * @brief CAN IFn_TXRQST0 Bit Field Definitions
 */
#define CAN_IF_TXRQST0_TXRQST_Pos  0                                        /*!< CAN_T::IFnTXRQST0: TXRQST Position   */
#define CAN_IF_TXRQST0_TXRQST_Msk  (0xFFFFul << CAN_IF_TXRQST0_TXRQST_Pos)  /*!< CAN_T::IFnTXRQST0: TXRQST Mask       */

/**
 * @brief CAN IFn_TXRQST1 Bit Field Definitions
 */
#define CAN_IF_TXRQST1_TXRQST_Pos  0                                        /*!< CAN_T::IFnTXRQST1: TXRQST Position   */
#define CAN_IF_TXRQST1_TXRQST_Msk  (0xFFFFul << CAN_IF_TXRQST1_TXRQST_Pos)  /*!< CAN_T::IFnTXRQST1: TXRQST Mask       */

/**
 * @brief CAN IFn_NDAT0 Bit Field Definitions
 */
#define CAN_IF_NDAT0_NEWDATA_Pos   0                                        /*!< CAN_T::IFnNDAT0: NEWDATA Position    */
#define CAN_IF_NDAT0_NEWDATA_Msk   (0xFFFFul << CAN_IF_NDAT0_NEWDATA_Pos)   /*!< CAN_T::IFnNDAT0: NEWDATA Mask        */

/**
 * @brief CAN IFn_NDAT1 Bit Field Definitions
 */
#define CAN_IF_NDAT1_NEWDATA_Pos   0                                        /*!< CAN_T::IFnNDAT1: NEWDATA Position    */
#define CAN_IF_NDAT1_NEWDATA_Msk   (0xFFFFul << CAN_IF_NDAT1_NEWDATA_Pos)   /*!< CAN_T::IFnNDAT1: NEWDATA Mask        */

/**
 * @brief CAN IFn_IPND0 Bit Field Definitions
 */
#define CAN_IF_IPND0_INTPND_Pos   0                                         /*!< CAN_T::IFnIPND0: INTPND Position     */
#define CAN_IF_IPND0_INTPND_Msk   (0xFFFFul << CAN_IF_IPND0_INTPND_Pos)     /*!< CAN_T::IFnIPND0: INTPND Mask         */

/**
 * @brief CAN IFn_IPND1 Bit Field Definitions
 */
#define CAN_IF_IPND1_INTPND_Pos   0                                         /*!< CAN_T::IFnIPND1: INTPND Position     */
#define CAN_IF_IPND1_INTPND_Msk   (0xFFFFul << CAN_IF_IPND1_INTPND_Pos)     /*!< CAN_T::IFnIPND1: INTPND Mask         */

/**
 * @brief CAN IFn_MVLD0 Bit Field Definitions
 */
#define CAN_IF_MVLD0_MSGVAL_Pos   0                                         /*!< CAN_T::IFnMVLD0: MSGVAL Position     */
#define CAN_IF_MVLD0_MSGVAL_Msk   (0xFFFFul << CAN_IF_MVLD0_MSGVAL_Pos)     /*!< CAN_T::IFnMVLD0: MSGVAL Mask         */

/**
 * @brief CAN IFn_MVLD1 Bit Field Definitions
 */
#define CAN_IF_MVLD1_MSGVAL_Pos   0                                         /*!< CAN_T::IFnMVLD1: MSGVAL Position     */
#define CAN_IF_MVLD1_MSGVAL_Msk   (0xFFFFul << CAN_IF_MVLD1_MSGVAL_Pos)     /*!< CAN_T::IFnMVLD1: MSGVAL Mask         */
/**
  * @}
  */

/* Exported functions --------------------------------------------------------------------------------------*/
/** @defgroup CAN_Exported_Functions CAN exported functions
  * @{
  */
/* Initialization functions *********************************************************************************/
void CAN_DeInit(HT_CAN_TypeDef* CANx);
void CAN_Init(HT_CAN_TypeDef* CANx, CAN_InitTypeDef* CAN_InitStruct);

/* Interrupts and flags management functions ****************************************************************/
void CAN_IntConfig(HT_CAN_TypeDef *CANx, u32 CAN_Int, ControlStatus NewState);
FlagStatus CAN_GetIntStatus(HT_CAN_TypeDef* CANx, u32 CAN_Int);
FlagStatus CAN_GetFlagStatus(HT_CAN_TypeDef* CANx, uint32_t CAN_Flag);
void CAN_ClearFlag(HT_CAN_TypeDef* CANx, uint32_t CAN_Flag);

/* Error management functions *******************************************************************************/
CAN_LastErrorCode_TypeDef CAN_GetLastErrorCode(HT_CAN_TypeDef* CANx);
u32 CAN_GetReceiveErrorCounter(HT_CAN_TypeDef* CANx);
u32 CAN_GetLSBTransmitErrorCounter(HT_CAN_TypeDef* CANx);
void CAN_BusOffRecovery(HT_CAN_TypeDef *CANx);

/* Test Mode functions **************************************************************************************/
void CAN_EnterTestMode(HT_CAN_TypeDef *CANx, u32 u8TestMask);
void CAN_LeaveTestMode(HT_CAN_TypeDef *CANx);
ErrStatus CAN_BasicSendMsg(HT_CAN_TypeDef *CANx, CAN_MSG_TypeDef* pCanMsg, u8* data, u8 len);
ErrStatus CAN_BasicReceiveMsg(HT_CAN_TypeDef *CANx, CAN_MSG_TypeDef* pCanMsg, u8* data, u8* len);

/* Transmit/Receive functions *******************************************************************************/
ErrStatus CAN_Transmit(HT_CAN_TypeDef *CANx, CAN_MSG_TypeDef* pCanMsg, u8* data, u8 len);
CAN_RxStatus_TypeDef CAN_Receive(HT_CAN_TypeDef *CANx, CAN_MSG_TypeDef* pCanMsg, u8* data, u32* len);
ErrStatus CAN_UpdateTxMsgData(HT_CAN_TypeDef *CANx, CAN_MSG_TypeDef* pCanMsg, u8* data, u8 len);
ErrStatus CAN_TriggerTxMsg(HT_CAN_TypeDef *CANx, CAN_MSG_TypeDef* pCanMsg);

/* Set Rx Message Object ************************************************************************************/
ErrStatus CAN_SetRxMsg(HT_CAN_TypeDef *CANx ,CAN_MSG_TypeDef* pCanMsg, u32 FifoDepth);

/* Message Object status function ***************************************************************************/
ErrStatus CAN_CancelTransmit(HT_CAN_TypeDef* CANx, CAN_MSG_TypeDef* pCanMsg);
ErrStatus CAN_DiscardRxMsg(HT_CAN_TypeDef *CANx, CAN_MSG_TypeDef* pCanMsg);
bool      CAN_NewDataReceived(HT_CAN_TypeDef *CANx, CAN_MSG_TypeDef* pCanMsg);
s32       CAN_TransmitStatus(HT_CAN_TypeDef* CANx, CAN_MSG_TypeDef* pCanMsg);
bool      CAN_GetMsgPending(HT_CAN_TypeDef* CANx, CAN_MSG_TypeDef* pCanMsg);
ErrStatus CAN_ClearMsgPendingFlag(HT_CAN_TypeDef *CANx, CAN_MSG_TypeDef* pCanMsg);
void      CAN_ClearAllMsgPendingFlag(HT_CAN_TypeDef *CANx);
/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif
